#Missing Data 
<br>
NaN (Not a Number)
<br> 
NULL
<br>
<br>

## It is important to take into account the values to proceed correctly.

In [1]:
import pandas as pd
from io import StringIO

In [2]:
csv_data= \
'''A,B,C,D
1.0,2.0,3.0,4.0
5.0,6.0,8.0
10.0,11.0,12.0,'''

In [3]:
df=pd.read_csv(StringIO(csv_data))
df

      A     B     C    D
0   1.0   2.0   3.0  4.0
1   5.0   6.0   8.0  NaN
2  10.0  11.0  12.0  NaN

We can use the isnull method to return a DataFrame  with boolean values
<br>
indicating if a cell contains numerical values (False) a missing value (True)

In [4]:
df.isnull()

       A      B      C      D
0  False  False  False  False
1  False  False  False   True
2  False  False  False   True

And the number of missing values. ***In this case we'll have two missing values in column D:***

In [5]:
df.isnull().sum()

A    0
B    0
C    0
D    2
dtype: int64

Using the method .values, we can access the numpy matrix as follows:

In [6]:
df.values

array([[ 1.,  2.,  3.,  4.],
       [ 5.,  6.,  8., nan],
       [10., 11., 12., nan]])

Using the dropna method we can eliminate rows or columns that contain missing values. For example, in the next case we eliminate the last column applying "axis=1"

In [7]:
df.dropna(axis=1)

      A     B     C
0   1.0   2.0   3.0
1   5.0   6.0   8.0
2  10.0  11.0  12.0

## Example with missing values in different columns:

In [8]:
csv_data1= \
'''
A,B,C,D,E
1.0,2.0,3.0,4.0,5.0
6.0,,8.0,,9.0
,11.0,12.0,13.0,
'''

In [9]:
df1=pd.read_csv(StringIO(csv_data1))
df1

     A     B     C     D    E
0  1.0   2.0   3.0   4.0  5.0
1  6.0   NaN   8.0   NaN  9.0
2  NaN  11.0  12.0  13.0  NaN

We are going to interpolate the missing values using Imputer from Sklearn.

In [10]:
from sklearn.impute import SimpleImputer

In [11]:
imr=SimpleImputer(strategy='mean')
imr=imr.fit(df1.values)

In [12]:
imputed_data=imr.transform(df1.values)
print(imputed_data)

[[ 1.   2.   3.   4.   5. ]
 [ 6.   6.5  8.   8.5  9. ]
 [ 3.5 11.  12.  13.   7. ]]